{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "NodeUpgrade",
			"Children": [
				{
					"Source":
					{
						"Text": "+{Amount}"
					},
					"Translation":
					{
						"Text": "+{Amount}"
					},
					"Key": "ui.refund_amount"
				},
				{
					"Source":
					{
						"Text": "Close"
					},
					"Translation":
					{
						"Text": "关闭"
					},
					"Key": "ui.close"
				},
				{
					"Source":
					{
						"Text": "Cost"
					},
					"Translation":
					{
						"Text": "费用"
					},
					"Key": "ui.cost"
				},
				{
					"Source":
					{
						"Text": "Current purity"
					},
					"Translation":
					{
						"Text": "当前纯度"
					},
					"Key": "ui.current_purity"
				},
				{
					"Source":
					{
						"Text": "Downgrade"
					},
					"Translation":
					{
						"Text": "降级"
					},
					"Key": "ui.downgrade"
				},
				{
					"Source":
					{
						"Text": "Extraction rate ×{Before} → ×{After}"
					},
					"Translation":
					{
						"Text": "开采速度 ×{Before} → ×{After}"
					},
					"Key": "ui.extraction_rate"
				},
				{
					"Source":
					{
						"Text": "Impure"
					},
					"Translation":
					{
						"Text": "不纯"
					},
					"Key": "purity.impure"
				},
				{
					"Source":
					{
						"Text": "Missing: {Count}"
					},
					"Translation":
					{
						"Text": "缺少：{Count}"
					},
					"Key": "ui.missing"
				},
				{
					"Source":
					{
						"Text": "New purity"
					},
					"Translation":
					{
						"Text": "新纯度"
					},
					"Key": "ui.new_purity"
				},
				{
					"Source":
					{
						"Text": "No valid upgrade cost is defined for this node"
					},
					"Translation":
					{
						"Text": "未为此节点定义有效的升级费用"
					},
					"Key": "err.config"
				},
				{
					"Source":
					{
						"Text": "Node downgraded to {Purity}"
					},
					"Translation":
					{
						"Text": "节点已降级为{Purity}"
					},
					"Key": "msg.downgraded"
				},
				{
					"Source":
					{
						"Text": "Node upgraded to {Purity}"
					},
					"Translation":
					{
						"Text": "节点已升级为{Purity}"
					},
					"Key": "msg.upgraded"
				},
				{
					"Source":
					{
						"Text": "Normal"
					},
					"Translation":
					{
						"Text": "普通"
					},
					"Key": "purity.normal"
				},
				{
					"Source":
					{
						"Text": "Not enough inventory space for the refund"
					},
					"Translation":
					{
						"Text": "背包空间不足，无法接收返还物品"
					},
					"Key": "err.inventory_full"
				},
				{
					"Source":
					{
						"Text": "Not enough items"
					},
					"Translation":
					{
						"Text": "物品不足"
					},
					"Key": "err.not_enough_items"
				},
				{
					"Source":
					{
						"Text": "Open node upgrade menu"
					},
					"Translation":
					{
						"Text": "打开节点升级菜单"
					},
					"Key": "input.open_menu"
				},
				{
					"Source":
					{
						"Text": "Opens the upgrade menu of the resource node you are looking at."
					},
					"Translation":
					{
						"Text": "打开你正在注视的资源节点的升级菜单。"
					},
					"Key": "input.open_menu.description"
				},
				{
					"Source":
					{
						"Text": "Pure"
					},
					"Translation":
					{
						"Text": "纯净"
					},
					"Key": "purity.pure"
				},
				{
					"Source":
					{
						"Text": "Refund"
					},
					"Translation":
					{
						"Text": "返还"
					},
					"Key": "ui.refund"
				},
				{
					"Source":
					{
						"Text": "Refund if downgraded to {Purity}"
					},
					"Translation":
					{
						"Text": "降级为{Purity}时的返还"
					},
					"Key": "ui.refund_header"
				},
				{
					"Source":
					{
						"Text": "Resource node upgrade"
					},
					"Translation":
					{
						"Text": "资源节点升级"
					},
					"Key": "ui.title"
				},
				{
					"Source":
					{
						"Text": "This node cannot be upgraded"
					},
					"Translation":
					{
						"Text": "此节点无法升级"
					},
					"Key": "err.unsupported"
				},
				{
					"Source":
					{
						"Text": "This node cannot go below its original purity"
					},
					"Translation":
					{
						"Text": "此节点不能低于其原始纯度"
					},
					"Key": "err.base_purity"
				},
				{
					"Source":
					{
						"Text": "This node is already at maximum purity"
					},
					"Translation":
					{
						"Text": "此节点已达到最高纯度"
					},
					"Key": "err.max_purity"
				},
				{
					"Source":
					{
						"Text": "Upgrade"
					},
					"Translation":
					{
						"Text": "升级"
					},
					"Key": "ui.upgrade"
				},
				{
					"Source":
					{
						"Text": "{Owned} / {Required}"
					},
					"Translation":
					{
						"Text": "{Owned} / {Required}"
					},
					"Key": "ui.amount_owned"
				}
			]
		},
		{
			"Namespace": "NodeUpgradeDebug",
			"Children": [
				{
					"Source":
					{
						"Text": ", "
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ItemSeparator"
				},
				{
					"Source":
					{
						"Text": "/nodeupgrade (alias /nu) info | setpurity <impure|normal|pure> | upgrade | downgrade | give <ItemClass> [amount] | validate | reload"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Usage"
				},
				{
					"Source":
					{
						"Text": "Aim at a resource node (or at an extractor built on it) first."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NoTarget"
				},
				{
					"Source":
					{
						"Text": "No cost table loaded. Check FactoryGame.log for LogNodeUpgrade errors."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ValidateNotLoaded"
				},
				{
					"Source":
					{
						"Text": "No extractor or generator on this node."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InfoNoBuilding"
				},
				{
					"Source":
					{
						"Text": "Node {Name}: {Resource} ({Class}), kind {Kind}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InfoNode"
				},
				{
					"Source":
					{
						"Text": "Paid for {Tier}: {Items}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InfoPaid"
				},
				{
					"Source":
					{
						"Text": "Purity {Purity} | original {Original} | modified by the mod: {Modified} | cost entry: {Entry}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InfoPurity"
				},
				{
					"Source":
					{
						"Text": "This command needs you on foot (not in a vehicle)."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NoCharacter"
				},
				{
					"Source":
					{
						"Text": "costs.json reloaded: {Result}, {Entries} entries, {Errors} errors, {Warnings} warnings. Already paid refunds are unchanged."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ReloadDone"
				},
				{
					"Source":
					{
						"Text": "failed (previous table kept)"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Failed"
				},
				{
					"Source":
					{
						"Text": "no"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "No"
				},
				{
					"Source":
					{
						"Text": "none"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "None"
				},
				{
					"Source":
					{
						"Text": "none"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NoEntry"
				},
				{
					"Source":
					{
						"Text": "nothing"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Nothing"
				},
				{
					"Source":
					{
						"Text": "ok"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Ok"
				},
				{
					"Source":
					{
						"Text": "unknown item"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "UnknownItem"
				},
				{
					"Source":
					{
						"Text": "yes"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Yes"
				},
				{
					"Source":
					{
						"Text": "{Amount} x {Item}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ItemAmount"
				},
				{
					"Source":
					{
						"Text": "{Entries} entries, {Found} / {Total} item classes found, refund ratio {Ratio}. File: {Path}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ValidateSummary"
				},
				{
					"Source":
					{
						"Text": "{Entry} / {Tier}: item class {Class} not found"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ValidateMissing"
				},
				{
					"Source":
					{
						"Text": "{Name}: {Min} - {Max} MW"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InfoGeoThermal"
				},
				{
					"Source":
					{
						"Text": "{Name}: {Rate}/min, cycle {Cycle} s"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InfoExtractor"
				}
			]
		}
	]
}